# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [7]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [13]:
x = np.random.randint(1,5,100)
y = np.random.randint(1,4,100)
z = np.random.randint(10000,30000,100)

### Step 3. Let's create a DataFrame by joinning the Series by column

In [31]:
p_dict = {
   'x' : x,
    'y':y,
    'z':z
}
df=pd.DataFrame(p_dict)
df

    x  y      z
0   3  2  10060
1   1  2  20188
2   2  3  27321
3   1  3  27205
4   1  2  12438
.. .. ..    ...
95  2  3  28144
96  4  1  12531
97  1  2  27881
98  2  1  16249
99  3  2  15932

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [37]:
df.rename(columns = {'x':'bedrs',
                         "y":'bathrs',
                         'z':'price_sqr_meter'},inplace=True)
df

    bedrs  bathrs  price_sqr_meter
0       3       2            10060
1       1       2            20188
2       2       3            27321
3       1       3            27205
4       1       2            12438
..    ...     ...              ...
95      2       3            28144
96      4       1            12531
97      1       2            27881
98      2       1            16249
99      3       2            15932

[100 rows x 3 columns]

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

### Step 6. Oops, it seems it is going only until index 99. Is it true?

### Step 7. Reindex the DataFrame so it goes from 0 to 299